In [5]:
#How TO Merge And Concate two DataFrame
import pandas as pd

In [4]:
india_weather = {
    'city': ['Jaipur','Lucknow','banaras'],
    'Tempreture': [20,30,40]
}

In [6]:
df1 = pd.DataFrame(india_weather)

In [7]:
usa_weather = {
    'city': ['London','Aukland','Orland'],
    'Tempreture': [10,20,30]
}

In [8]:
df2 = pd.DataFrame(usa_weather)

In [10]:
concat = pd.concat([df1,df2])

In [11]:
df1

      city  Tempreture
0   Jaipur          20
1  Lucknow          30
2  banaras          40

In [12]:
df2

      city  Tempreture
0   London          10
1  Aukland          20
2   Orland          30

In [13]:
concat

      city  Tempreture
0   Jaipur          20
1  Lucknow          30
2  banaras          40
0   London          10
1  Aukland          20
2   Orland          30

In [14]:
concat1 = pd.concat([df1,df2],ignore_index=True)

In [15]:
concat1

      city  Tempreture
0   Jaipur          20
1  Lucknow          30
2  banaras          40
3   London          10
4  Aukland          20
5   Orland          30

In [ ]:
#Here We Start New Journey Of Merge

In [18]:
india_weather = {
    'city': ['Jaipur','Lucknow','banaras'],
    'Tempreture': [20,30,40]
}
df1 = pd.DataFrame(india_weather)

In [19]:
india_weather = {
    'city': ['Agra','Lucknow','banaras'],
    'humidity': [20,30,40]
}
df2 = pd.DataFrame(india_weather)

In [24]:
merge = pd.merge(df1,df2,on='city',how='outer')

In [25]:
merge

      city  Tempreture  humidity
0   Jaipur        20.0       NaN
1  Lucknow        30.0      30.0
2  banaras        40.0      40.0
3     Agra         NaN      20.0

In [ ]:
#so u Can use inner,outer,right,Left

In [ ]:
'''
Most Important Point is We have two DataFrame,So we will think how to join both the Dataframes According to Row Wise.or Columns Wise
'''